tap "hashicorp/tap"
brew "atuin"
brew "btop"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "lazygit"
brew "libpq", link: true
brew "llvm"
brew "neovim"
brew "nmap"
brew "ripgrep"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "hashicorp/tap/terraform"
cask "librewolf"
cask "raycast"
cask "kitty"
cask "vscodium"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mikestead.dotenv"
vscode "ms-python.python"
vscode "pkief.material-icon-theme"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
